window.novelInfo = {
  title: "仙逆 (ស៊ាននី - Renegade Immortal)",
  author: "អ្នកនិពន្ធ: អឺកិន (耳根)",
  coverUrl: "Cover.jpg"
};

window.chaptersData = [
  {
    id: 1,
    volume: "ភាគទី ៧ ឈ្មោះល្បីរន្ទឺពេញល័រធាន (名震罗天)",
    title: "ជំពូកទី 758៖ វិមានប្រមូលកំណប់! (收藏品阁)",
    isVip: false, // ជំពូកនេះអានឥតគិតថ្លៃ
    content: "អ្នកហ្វឹកហាត់ ត្រកូលឆិនមានម្ជុលប្រាក់មួយបាច់នៅពីមុខខ្លួន... (ខ្លឹមសារអត្ថបទ)"
  },
  {
    id: 2,
    volume: "ភាគទី ៧ ឈ្មោះល្បីរន្ទឺពេញល័រធាន (名震罗天)",
    title: "ជំពូកទី 759៖ ការរស់ឡើងវិញ (复活) [VIP]",
    isVip: true, // ជំពូកនេះជាជំពូក VIP ត្រូវចាក់សោរ
    content: "«បើបានចងគំនុំជាមួយត្រកូលធំៗទាំងបួននេះទៅហើយ... (ខ្លឹមសារអត្ថបទ)"
  }
];
